export const QUESTIONS = {
  religious: [
    {
      q: 'من هو أول الخلفاء الراشدين؟',
      options: [
        'عمر بن الخطاب',
        'علي بن أبي طالب',
        'أبو بكر الصديق',
        'عثمان بن عفان',
      ],
      correct: 2,
    },
    {
      q: 'كم عدد أركان الإسلام؟',
      options: ['3', '4', '5', '6'],
      correct: 2,
    },
    {
      q: 'في أي شهر يصوم المسلمون؟',
      options: ['شعبان', 'رمضان', 'ذو الحجة', 'محرم'],
      correct: 1,
    },
    {
      q: 'أين نزل الوحي أول مرة؟',
      options: ['غار حراء', 'المسجد الحرام', 'المدينة', 'الطائف'],
      correct: 0,
    },
    {
      q: 'كم عدد الصلوات المفروضة؟',
      options: ['3', '4', '5', '6'],
      correct: 2,
    },
  ],
};
